---
kind: property
id: P:Autodesk.Revit.DB.Sketch.Profile
source: html/1fdfbff7-dfea-5d08-3583-89d0218eff3c.htm
---
# Autodesk.Revit.DB.Sketch.Profile Property

Returns the Profile of the Sketch.

## Syntax (C#)
```csharp
public CurveArrArray Profile { get; }
```

## Remarks
This property is used to retrieve the Profile of Sketch.